# 附录 B 机器学习项目清单

本份清单能引导你进行机器学习项目，有以下 8 个主要步骤：

1. 对问题建模，审视全局。
2. 得到数据。
3. 探索数据，获得思路。
4. 准备数据，更好地探索机器学习算法潜在的数据模式。
5. 探索多种不同模型，列出最好的几个。
6. 微调模型，将它们组合为一个更好的解。
7. 发表解决方案。
8. 启动、监控、维护系统。

显然，你应该根据自己的需求自由调整清单。

## 对问题建模，审视全局

1. 在业务项中定义目标。
2. 你的解决方案该如何使用？
3. 目前的解决方案是什么（如果有的话）？
4. 你该如何对问题建模（监督/非监督，在线/离线，等等）？
5. 该如何度量性能？
6. 性能度量该如何和业务项一致？
7. 达成业务目标所需的最低性能是什么？
8. 可比性问题是什么？你能重用经验或工具吗？
9. 人类的专业知识可用吗？
10. 你该如何手动解决问题？
11. 列出你（或其他人）至今为止做出的假设。
12. 如果可能的话，证明假设。

## 得到数据

注意：尽可能多地自动化，这样你能很容易得到新数据。

1. 列出你需要的数据，以及你需要的数量。
2. 找到并记录你可以找到这些数据的地方。
3. 检查它需要占用的空间。
4. 检查法律义务，如果可以的话获取授权。
5. 获取访问权限。
6. 创建工作区（有足够的存储空间）。
7. 获取数据。
8. 将数据格式转换为易于操作的格式（不改变数据自身）。
9. 确保敏感信息已被删除或保护（比如匿名信息）。
10. 检查数据的大小和类型（时间序列，样本，地理信息，等等）。
11. 取样一个测试集，将其放在一边，不再去看（不能偷看数据！）。

## 探索数据

注意：试着从一些领域专家中获得见解。

1. 创建数据的备份进行探索（如果可以的话，将其采样到可管理的大小）。
2. 创建 Jupyter Notebook，保存数据探索的记录。
3. 研究每个属性和它的特点：
- 名字
- 类型（地理坐标，整数/浮点数，有界/无界，文本，结构化，等等）
- 缺失值的百分比
- 噪音以及噪音的类型（随机，异常值，舍入误差，等等）
- 也许对任务有所用处？
- 分布类型（高斯分布，均匀分布，对数分布，等等）
4. 对于监督学习任务，确定目标属性。
5. 可视化数据。
6. 研究属性间的相关性。
7. 研究你该如何手动解决问题。
8. 确定你可能会应用的有希望的转变。
9. 确定额外有用的数据（见“得到数据”）。
10. 记录你学到的东西。

## 准备数据

注意：
- 在数据的备份上工作（保持源数据完好无损）.
- 为你应用的数据转换编写函数，有以下五个原因：
  - 这样下次获得新数据集的时候，你就可以很容易地准备好数据。
  - 这样在未来的工程中你也可以使用这些转换。
  - 为了清理和准备测试集。
  - 一旦解决方法是有效的，就可以清理和准备新的数据实例。
  - 为了能简单地将你的准备选择看作超参数。
 
1. 数据清理：
- 修复或移除异常值（可选）。
- 填充缺失值（比如，填充为零、均值、中位数……）或将它们整行（或整列）丢弃。
2. 特征选择（可选）：
- 舍弃无法对任务提供有用信息的属性。
3. 特征工程，适当地：
- 将连续的特征离散化。
- 分解特征（比如地理坐标，日期/时间，等等）。
- 增加有希望的特征转换（比如， log(x) ， sqrt(x)， x^2 ，等等）
- 将特征聚合为有希望的新特征。
4. 特征缩放：标准化或者归一化特征。

## 列出有希望的模型名单

注意：
- 如果数据很大，你可能会想采样更小的训练集，以在适当的时间里训练出许多不同的模型（要意识到，这样对于诸如大型神经网络或随机森林这样的复杂模型是不利的）。
- 再次尝试尽可能多地自动化这些步骤。

1. 使用标准参数从不同的类别（比如，线性，朴素贝叶斯， SVM ，随机森林，神经网络，等等）中训练许多快速但“脏”的模型。
2. 度量并比较它们的性能：
- 对于每个模型，使用 N-折交叉验证，计算平均值和性能度量在 N-折上的标准偏差。
3. 分析对于每种算法最重要的变量。
4. 分析模型会犯的错误的种类。
- 人类会使用什么数据来避免犯这些错呢？
5. 快速再来一遍特征选择和工程。
6. 对前面五个步骤进行一个或两个以上的快速迭代。
7. 列出最有希望的前三个到五个模型名单，选择犯了不同类型错误的模型。

## 微调系统

注意：
- 你会在本步骤中使用尽可能多的数据，尤其是在你到了微调的最终阶段。
- 将能自动化的都自动化。

1. 使用交叉验证微调超参数。
- 把你的数据转换选择看做超参数，尤其是当你不确定的时候（比如，我应该用零还是用中位数来取代缺失值？还是直接舍弃这一行？）。
- 除非能探索的超参数很少，否则就在网格搜索上随机搜索。如果训练过程很长，可能贝叶斯优化方法会更好（比如高斯过程先验，详见 [https://arxiv.org/pdf/1206.2944.pdf](https://arxiv.org/pdf/1206.2944.pdf) ）。
2. 尝试集成方法。将最好的模型结合起来总是会比单独运行它们表现更好。
3. 一旦你对最终模型很有信心，就在测试集上度量性能，评估泛化误差。

> **警告**
> 不要在测量了泛化误差之后再微调模型：你会开始过拟合测试集的。

## 发表解决方案

1. 记录你所做的事。
2. 创建一份优秀的演示报告。
- 确保你首先强调了重点。
3. 解释你的方案能达成业务目标的原因。
4. 别忘了展示你在项目中注意到的有趣之处。
- 描述起作用的和未其作用的部分。
- 列出你的假设和系统的局限。
5. 确保你的关键发现是通过漂亮的可视化图或易于记忆的陈述进行传达的（比如， “中位数收入是房价的头号预测因子” ）。

## 启动！

1. 为生产准备好解决方案（插入生产数据输入，编写单元测试，等等）。
2. 编写监控代码以定期检查系统的实时性能，当其下降时触发警报。
- 小心缓慢退化：当数据演化时，模型倾向于 “腐朽” 。
- 度量性能可能需要人工管道（比如，通过众包服务）。
- 也要监控输入的质量（比如，一个发送随机值的故障传感器，或是另一个输出变陈旧的团队）。对于在线学习系统，这尤其重要。
3. 定期更新新的数据模型（尽可能自动化）。
